//מה שהעתקנו מבק אנד 12 טריי אייסינק אינדק'ס ראשי 
// function wrapAsync(fn) {
//     return function (req, res, next) {
//         fn(req, res, next).catch(e => next(e))
//     }
// }

//השינוי:
//אנחנו מייצאים את אף אן שזה הפונקציה במתשקבלת ושולחים אותה בפונקציית ארוו ולא קוראים לה בשם
//שינו מספר 2 הפונקציית שכבה שאנחנו משתמשים גם מחקנו לה את השם ושלחנו את הבקשה התגובה והנקסט בפונקציית ארוו
//השורה השלישית נשארה אותו דבר


module.exports = func => {
    return (req, res, next) => {
        func(req, res, next).catch(next);
    }

}

